{
    "reptiles": {
        "description": "<p><b>Reptiles</b> are a group (<b>Reptilia</b>) of tetrapod animals comprising today's turtles, crocodilians, snakes, lizards, tuatara, and their extinct relatives. The study of these traditional reptile groups, historically combined with that of modern amphibians, is called herpetology. Because crocodilians are more closely related to birds than to any other group of reptiles, birds are also often included as a sub-group of reptiles by modern scientists.</p><p>The earliest known proto-reptiles originated around 315 million years ago during the Carboniferous period, having evolved from advanced reptiliomorph tetrapods that became increasingly adapted to life on dry land. Some early examples include the lizard-like Hylonomus and Casineria. In addition to the living reptiles, there are many diverse groups that are now extinct, in some cases due to mass extinction events. In particular, the K–Pg extinction wiped out the pterosaurs, plesiosaurs, ornithischians, and sauropods, as well as many species of theropods (e.g. tyrannosaurs and dromaeosaurids), crocodyliforms, and squamates (e.g. mosasaurids).</p><p>Modern reptiles inhabit every continent with the exception of Antarctica. Several living subgroups are recognized:</p><ul><li><b>Testudines</b> (turtles, terrapins and tortoises): approximately 400 species</li><li><b>Sphenodontia</b> (tuatara from New Zealand): 2 species</li><li><b>Squamata</b> (lizards, snakes, and worm lizards): over 9,600 species</li><li><b>Crocodilia</b> (crocodiles, gavials, caimans, and alligators): 25 species</li></ul><p>Because some reptiles are more closely related to birds than they are to other reptiles (crocodiles are more closely related to birds than they are to lizards),  many modern scientists prefer to make Reptilia a monophyletic grouping and so also include the birds, which today contain over 10,000 species.</p>"
    },
    "amphibians": {
        "description": "<p><b>Amphibians</b> are ectothermic, tetrapod vertebrates of the class <b>Amphibia</b>. Modern amphibians are all Lissamphibia. They inhabit a wide variety of habitats with most species living within terrestrial, fossorial, arboreal or freshwater aquatic ecosystems. Amphibians typically start out as larvae living in water, but some species have developed behavioural adaptations to bypass this. The young generally undergo metamorphosis from larva with gills to an adult air-breathing form with lungs. Amphibians use their skin as a secondary respiratory surface and some small terrestrial salamanders and frogs lack lungs and rely entirely on their skin. They are superficially similar to reptiles but, along with mammals and birds, reptiles are amniotes and do not require water bodies in which to breed. With their complex reproductive needs and permeable skins, amphibians are often ecological indicators and in recent decades there has been a dramatic decline in amphibian populations for many species around the globe.</p><ul><li>Subclass Temnospondyli† (diverse Paleozoic and early Mesozoic grade)</li><li>Subclass Lepospondyli† (small Paleozoic group, which may actually be more closely related to amniotes than Lissamphibia)</li><li>Subclass Lissamphibia (all modern amphibians, including frogs, toads, salamanders, newts and caecilians)</li><ul><li>Salientia (frogs, toads and relatives): Jurassic to present—6,200 current species in 53 families</li><li>Caudata (salamanders, newts and relatives): Jurassic to present—652 current species in 9 families</li><li>Gymnophiona (caecilians and relatives): Jurassic to present—192 current species in 10 families</li></ul></ul><p>The actual number of species in each group depends on the taxonomic classification followed. The two most common systems are the classification adopted by the website AmphibiaWeb, University of California, Berkeley and the classification by herpetologist Darrel Frost and the American Museum of Natural History, available as the online reference database \"Amphibian Species of the World\". </p>"
    },
    "mammals": {
        "description": "<p><b>Mammals</b> (class <b>Mammalia</b> /məˈmeɪli.ə/ from Latin mamma \"breast\") are any members of a clade of endothermic amniotes distinguished from reptiles and birds by the possession of hair, three middle ear bones, mammary glands, and a neocortex (a region of the brain). The mammalian brain regulates body temperature and the circulatory system, including the four-chambered heart.</p><p>Living mammal species can be identified by the presence of sweat glands, including those that are specialized to produce milk to nourish their young. In classifying fossils, however, other features must be used, since soft tissue glands and many other features are not visible in fossils.</p><p>Many traits shared by all living mammals appeared among the earliest members of the group:</p><ul><li><b>Jaw joint</b> - The dentary (the lower jaw bone which carries the teeth) and the squamosal (a small cranial bone) meet to form the joint. In most gnathostomes, including early therapsids, the joint consists of the articular (a small bone at the back of the lower jaw) and the quadrate (a small bone at the back of the upper jaw).</li><li><b>Middle ear</b> - In crown-group mammals, sound is carried from the eardrum by a chain of three bones, the malleus, the incus, and the stapes. Ancestrally, the malleus and the incus are derived from the articular and the quadrate bones that constituted the jaw joint of early therapsids.</li><li><b>Tooth replacement</b> - Teeth are replaced once or (as in toothed whales and murid rodents) not at all, rather than being replaced continually throughout life.</li><li><b>Prismatic enamel</b> - The enamel coating on the surface of a tooth consists of prisms, solid, rod-like structures extending from the dentin to the tooth's surface.</li><li><b>Occipital condyles</b> - Two knobs at the base of the skull fit into the topmost neck vertebra; most other tetrapods, in contrast, have only one such knob.</li></ul><p>For the most part, these characteristics were not present in the Triassic ancestors of the mammals.</p>"
    },
    "oviparous": {
        "description": "<p>Oviparous animals are animals that lay eggs, with little or no  other embryonic development within the mother. This is the reproductive method of most fish, amphibians, reptiles, all birds, the monotremes, and most insects, molluscs, and arachnids.</p><p>Five modes of reproduction can be differentiated based on relations between zygote and parents:</p><ul><li>Ovuliparity: fertilisation is external (in arthropods and fishes, most of frogs)</li><li>Oviparity: fertilisation is internal, the female lays zygotes as eggs with important vitellus (typically birds)</li><li>Ovo-viviparity: or oviparity with retention of zygotes in the female's body or in the male's body, but there are no trophic interactions between zygote and parents. (Anguis fragilis is an example of ovo-viviparity.) In the sea horse, zygotes are retained in the male's ventral \"marsupium\". In the frog Rhinoderma darwinii, the zygotes developed in the vocal sac. In the frog Rheobatrachus, zygotes developed in the stomach.</li><li>Histotrophic viviparity: the zygotes developed in the female's oviducts, but find their nutriments by oophagy or adelphophagy (intra-uterine cannibalism in some sharks or in the black salamander Salamandra atra).</li><li>Hemotrophic viviparity: nutriments are provided by the female, often through placenta. In the frog Gastrotheca ovifera, embryos are fed by the mother through specialized gills. The lizard Pseudomoia pagenstecheri and most mammals exhibit a hemotrophic viviparity.</li></ul>"
    },
    "coelenterates": {
        "description": "<p><b>Coelenterata</b> is an obsolete term encompassing two animal phyla, the Ctenophora (comb jellies) and the Cnidaria (coral animals, true jellies, sea anemones, sea pens, and their allies). The name comes from the Greek \"koilos\" (\"full bellied\"), referring to the hollow body cavity common to these two phyla. They have very simple tissue organization, with only two layers of cells, external and internal and radial symmetry. Some of the examples are corals, sea anemone which are colonial and hydra, jelly fish which are solitary.</p><p>All coelenterates are aquatic, mostly marine. The bodyform is radially symmetrical. The body has a single opening hypostome surrounded by sensory tentacles equipped with either nematocysts or <i>collobasts</i> to capture mostly planktonic prey. These tentacles surround a spacious cavity called the gastrovascular cavity or coelenteron. Digestion is both intracellular and extracellular. Respiration and excretion are accomplished by simple diffusion. A network of nerves is spread throughout the body. Many forms exhibit polymorphism, wherein different types of individuals are present in a colony for different functions. These individuals are called Zooids. These animals generally reproduce asexually by budding, though sexual reproduction does occur in some groups.</p><p>The term coelenterate is not currently recognized as scientifically valid, as the Cnidaria and Ctenophora have less in common than previously assumed. Any group containing the two but excluding other phyla would be paraphyletic. Nonetheless, the term coelenterate is still used in informal settings to refer to the Cnidaria and Ctenophora.</p><p>Complicating the issue is the 1997 work of Lynn Margulis (revising an earlier model by Thomas Cavalier-Smith) that placed the Cnidaria and Ctenophora alone in the branch Radiata within Eumetazoa.(The latter refers to all the animals except the sponges, Trichoplax, and the still poorly understood Mesozoa.) Neither grouping is accepted universally; however, both are commonly encountered in taxonomic literature.</p><p>The Coelenterata hypothesis has been more recently revived, based on molecular data, placing the Coelenterates as a monophyletic sister-group to the Bilateria.</p>"
    },
    "echinoderms": {
        "description": "<p><b>Echinoderm</b> is the common name given to any member of the Phylum <b>Echinodermata</b> (from Ancient Greek, ἐχῖνος, echinos – \"hedgehog\" and δέρμα, derma – \"skin\") of marine animals. The adults are recognizable by their (usually five-point) radial symmetry, and include such well-known animals as starfish, sea urchins, sand dollars, and sea cucumbers, as well as the sea lilies or \"stone lilies\". Echinoderms are found at every ocean depth, from the intertidal zone to the abyssal zone. The phylum contains about 7000 living species, making it the second-largest grouping of deuterostomes (a superphylum), after the chordates (which include the vertebrates, such as birds, fishes, mammals, and reptiles). Echinoderms are also the largest phylum that has no freshwater or terrestrial (land-based) representatives.</p><p>Aside from the hard-to-classify Arkarua (a Precambrian animal with Echinoderm-like pentamerous radial symmetry), the first definitive members of the phylum appeared near the start of the Cambrian.</p><p>The echinoderms are important both biologically and geologically. Biologically, there are few other groupings so abundant in the biotic desert of the deep sea, as well as shallower oceans. The more notably distinct trait, which most echinoderms have, is their remarkable powers of regeneration of tissue, organs, limbs, and of asexual reproduction, and in some cases, complete regeneration from a single limb. Geologically, the value of echinoderms is in their ossified skeletons, which are major contributors to many limestone formations, and can provide valuable clues as to the geological environment. Further, it is held by some scientists that the radiation of echinoderms was responsible for the Mesozoic Marine Revolution.</p>"
    }
}
